#1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.

name = 'Любoвь'
age = 39
profession = 'Инженер - строитель'
after_age = 39 + 10
print(f'Привет! Меня зовут {name}. Мне {age} лет. По профессии {profession}. Через 10 лет мне будет {after_age} и возможно станет совсем грустно, что я не попробовала себя в другой профессии.')

name = input('Введите ваше имя - ')
age = int(input('Сколько вам лет? - '))

print(f'Вас зовут {name}. Вам {age} лет')

